<?xml version="1.0" encoding="UTF-8" ?>
<source>
    <jobs>
        <job>
            <title>Acceptant Volmacht Medior - Verzuim</title>
            <date>Fri, 07 03 2025 00:00:00 GMT</date>
            <ID>100001-nl_NL</ID>
            <url>http://test.com</url>
            <company>Coca-Cola Canada Bottling Limited</company>
            <city>Vancouver</city>
            <state>BC</state>
            <postalcode>V6W 1G4</postalcode>
            <country>CA</country>
            <multilocation>Vancouver, BC, CA, V6W 1G4</multilocation>
            <category>Administratief/Klerikaal/Kantoorondersteuning</category>
            <department>Personeelszaken West OU</department>
            <type></type>
            <businessunit>Coke Canada</businessunit>
            <recruiter>thao.le+458935@paradox.ai</recruiter>
            <hiringmanager>thao.le+22894@paradox.ai</hiringmanager>
            <recruiterid>1004551</recruiterid>
            <jobtype>Richmond Field Op, BC (5C16)</jobtype>
            <brand>canada</brand>
            <customfield1>Reguliere Werknemer Voltijd</customfield1>
            <customfield2>Salaried</customfield2>
            <customfield3>Richmond Field Op, BC (5C16)</customfield3>
            <customfield4></customfield4>
            <customfield5>Dit is een testbaan in het Nederlands</customfield5>
            <description>Dit is een testbaan in het Nederlands</description>
        </job>
        <job>
            <title>Underwriter (Mandate) Mid-level – Absence</title>
            <date>Fri, 07 03 2025 00:00:00 GMT</date>
            <ID>100001-en_GB</ID>
            <url>http://test.com</url>
            <company>Coca-Cola Canada Bottling Limited</company>
            <city>Vancouver</city>
            <state>BC</state>
            <postalcode>V6W 1G4</postalcode>
            <country>CA</country>
            <multilocation>Vancouver, BC, CA, V6W 1G4</multilocation>
            <category>Administrative/Clerical/Office Support</category>
            <department>West OU Human Resources</department>
            <type></type>
            <businessunit>Coke Canada</businessunit>
            <recruiter>thao.le+458935@paradox.ai</recruiter>
            <hiringmanager>thao.le+22894@paradox.ai</hiringmanager>
            <recruiterid>1004551</recruiterid>
            <jobtype>Richmond Field Op, BC (5C16)</jobtype>
            <brand>canada</brand>
            <customfield1>Regular Employee FT</customfield1>
            <customfield2>Salaried</customfield2>
            <customfield3>Richmond Field Op, BC (5C16)</customfield3>
            <customfield4></customfield4>
            <customfield5>Administrative/Clerical/Office Support</customfield5>
            <description>&lt;p&gt;Facility Location-&#160;Richmond&#160;&#160;&lt;/p&gt;&lt;p&gt;Work Location -&#160;&#160;&lt;/p&gt;&lt;p&gt;Posting Locations -&#160;Vancouver&lt;/p&gt;&lt;p&gt;Department -&#160;West OU Human Resources&#160;&lt;/p&gt;&lt;p&gt;Job Function&#160;-&#160;Administrative/Clerical/Office Support&#160;&lt;/p&gt;&lt;p&gt;Employee Type - &#160;Regular Employee FT &#160;Salaried&#160;&lt;/p&gt;&lt;p&gt;Shift/Hours &#8211;&#160;&#160;&lt;/p&gt;&lt;div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;About This Opportunity&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;Reporting to the Senior Director, Human Resources, the Human Resources Coordinator is critical to the success of our Human Resources (HR) and Talent Acquisition (TA) operations. The Human Resources Coordinator will establish optimized operations &amp;amp; best practices to support HR teams across Canada. The Human Resources Coordinator will work closely with the local Human Resources (HR) management team to support and proactively respond to employment and labour relations issues.&#160;&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;Responsibilities&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;Support the Human Resources Business Partner (HRBP) team in the execution of the HR cycle:&#160;&lt;ul&gt;&lt;li&gt;Grievance &amp;amp; discipline tracking&#160;&lt;/li&gt;&lt;li&gt;Attendance &amp;amp; chronic absenteeism tracking&#160;&lt;/li&gt;&lt;li&gt;Talent management process&#160;&lt;/li&gt;&lt;li&gt;Policy changes&#160;&lt;/li&gt;&lt;li&gt;Training sessions &amp;amp; company event support&#160;&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;li&gt;Provide operational and system support throughout the Talent Acquisition recruitment cycle:&#8239;&#160;&lt;ul&gt;&lt;li&gt;Manage high volume hourly and salaried employment letter administration&#8239;&#160;&lt;/li&gt;&lt;li&gt;Support job posting process with quality assurance &amp;amp; trouble shooting on internal and external job boards&#160;&lt;/li&gt;&lt;li&gt;Support with resume screening, candidate scheduling, and interview coordination&#160;&lt;/li&gt;&lt;li&gt;Support new hire system setup &amp;amp; first day onboarding&#160;&lt;/li&gt;&lt;li&gt;Manage the talent acquisition inbox by responding to inquiries and escalating issues where needed&#160;&lt;/li&gt;&lt;li&gt;Support TA reporting process on key metrics&#160;&lt;/li&gt;&lt;/ul&gt;&lt;/li&gt;&lt;li&gt;Leverage tools, knowledge, and information sources to support reporting and updates on HR metrics&#160;&lt;/li&gt;&lt;li&gt;Support internal department and company-wide communication&#160;&lt;/li&gt;&lt;li&gt;Update HR templates and internal process documents&#160;&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;/div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;Qualifications&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;Post-Secondary/College or University Degree&#160;&lt;/li&gt;&lt;li&gt;Minimum one (1) year entry-level HR experience&#160;&lt;/li&gt;&lt;li&gt;Proficient in Microsoft Office suite - Microsoft Excel and PowerPoint presentations required&#160;&lt;/li&gt;&lt;li&gt;Solid critical thinking, agility, and customer centric interpersonal skills&#160;&lt;/li&gt;&lt;li&gt;Previous experience working with Human Resources Information Systems with SAP SuccessFactors preferred&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;&lt;br&gt;&lt;b&gt;About Us: Proudly Canadian and Independently Owned, We are Coke Canada!&lt;/b&gt;&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;Coca-Cola Canada Bottling Limited is Canada&#8217;s premier bottling company. We are an independently owned business encompassing over 5,800 associates, more than 50 sales and distribution centers, and 5 production facilities nationwide.&lt;/p&gt;&lt;p&gt;For more information about Coke Canada Bottling, please visit cokecanada.com&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;&lt;b&gt;Important&lt;/b&gt;&lt;/p&gt;&lt;p&gt;All offers of employment at Coca-Cola Canada Bottling Limited (&#8220;Coke Canada Bottling&#8221;) are conditional upon a successful background clearance obtained through our contracted third-party vendor. The standard clearance requirements depend on the position and may include some or all of the following: criminal clearance, employment verification, education verification and drivers abstract review. Please advise the Talent Acquisition team if you have any questions or concerns in regards to this once you are contacted for further consideration.&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;Coke Canada Bottling is committed to creating a diverse and inclusive workforce with several programs, policies and resources in place to support our people. For individuals requiring accommodations or support throughout the recruitment process please contact our Talent Acquisition Services team by calling 1-844-383-2653 or email HR@cokecanada.com.&lt;/p&gt;</description>
        </job>
    <job>
            <title>Superviseur, execution des ventes</title>
            <date>Fri, 13 06 2025 00:00:00 GMT</date>
            <ID>100002-fr_CA</ID>
            <url>https://conaservict1.valhalla.stage.jobs2web.com/canada/job/Amherst-Superviseur%2C-execution-des-ventes-QC-H1N-2G9/143644250/?feedId=4758750&amp;utm_source=Paradox</url>
            <company>Compagnie d&#8217;embouteillage Coca-Cola Canada Limit&#233;e</company>
            <city>Amherst</city>
            <state>QC</state>
            <postalcode>H1N 2G9</postalcode>
            <country>CA</country>
            <multilocation>Amherst, QC, CA, H1N 2G9</multilocation>
            <category>Finance and Accounting</category>
            <department>L&apos;Assomption - Merchandising 3</department>
            <type></type>
            <businessunit>Coke Canada</businessunit>
            <recruiter>thao.le+458935@paradox.ai</recruiter>
            <hiringmanager>thao.le+22894@paradox.ai</hiringmanager>
            <recruiterid>1004551</recruiterid>
            <jobtype>L&apos;Assomption, QC (5C51)</jobtype>
            <brand>canada</brand>
            <customfield1>Regular Employee FT</customfield1>
            <customfield2>Salaried</customfield2>
            <customfield3>L&apos;Assomption, QC (5C51)</customfield3>
            <customfield4></customfield4>
            <customfield5>Finance and Accounting</customfield5>
            <description>&lt;p&gt;Lieu de L&#8217; &#201;tablissement - L&apos;Assomption &#160;&lt;/p&gt;&lt;p&gt;Lieu de D&#8217;Affichage - Amherst&lt;/p&gt;&lt;p&gt;D&#233;partement - L&apos;Assomption - Merchandising 3&lt;/p&gt;&lt;p&gt;Fonction d&#8217;emploi - Finance and Accounting&lt;/p&gt;&lt;p&gt;Type D&#8217;Employ&#233; - Regular Employee FT&#160; Salaried&lt;/p&gt;&lt;p&gt;D&#233;calage/Heures - &lt;/p&gt;&lt;div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;&#192; propos de cette occasion&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;Le superviseur de l&#8217;ex&#233;cution des ventes (SEV) dirige directement l&#8217;&#233;quipe d&#8217;ex&#233;cution des ventes de Coke Canada dans le secteur assign&#233;. Il est charg&#233; de traduire les priorit&#233;s strat&#233;giques en ex&#233;cution op&#233;rationnelle dans les entrep&#244;ts des clients de Coke Canada. La client&#232;le sera principalement compos&#233;e de cha&#238;nes d&#8217;&#233;piceries nationales et locales et de grandes surfaces.&lt;/p&gt;&lt;p&gt;Par l&#8217;interm&#233;diaire de l&#8217;&#233;quipe d&#8217;ex&#233;cution des ventes, le SEV est charg&#233; de veiller &#224; ce que les produits de la gamme de boissons de Coke Canada soient toujours &#171; en stock &#187; sur les &#233;tag&#232;res, dans les pr&#233;sentoirs et dans les frigos, afin de r&#233;aliser des ventes optimales et de s&#8217;assurer que nos produits sont ex&#233;cut&#233;s conform&#233;ment aux normes de la soci&#233;t&#233;.&lt;/p&gt;&lt;p&gt;Nous nous effor&#231;ons d&#8217;&#234;tre le fournisseur le plus appr&#233;ci&#233; de nos clients en offrant un service &#224; la client&#232;le de qualit&#233; sup&#233;rieure et en nous d&#233;marquant de la concurrence. Nous r&#233;alisons tous ces objectifs tout en atteignant nos cibles budg&#233;taires.&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;Responsabilit&#233;s&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Embaucher, former, &#233;valuer et perfectionner une &#233;quipe de repr&#233;sentants &#224; l&#8217;ex&#233;cution des ventes (REV) &#224;&#160;temps plein et &#224; temps partiel.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;&#201;tablir un partenariat avec les clients et veiller &#224; ce que leurs besoins soient satisfaits. R&#233;pondre rapidement aux questions et aux probl&#232;mes des clients.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;N&#233;gocier et optimiser les niveaux de service &#224; la client&#232;le conform&#233;ment aux directives de la soci&#233;t&#233;.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Visiter les magasins des clients pour assurer la conformit&#233; aux normes d&#8217;ex&#233;cution et garantir la satisfaction des clients.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Planifier l&#8217;atteinte des objectifs des membres de l&#8217;&#233;quipe afin de r&#233;pondre aux exigences de la soci&#233;t&#233;, en adaptant la main-d&#8217;&#339;uvre au volume de travail.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;G&#233;rer l&#8217;&#233;quipe dans le respect du budget de travail et d&#8217;exploitation.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Collaborer quotidiennement avec les partenaires internes des ventes et des op&#233;rations clients pour assurer une harmonisation de toutes les initiatives.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;/div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;Comp&#233;tences&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Baccalaur&#233;at en commerce ou dans un domaine connexe de pr&#233;f&#233;rence avec &lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Une exp&#233;rience progressive de un &#224; trois ans dans le domaine de la vente.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Exp&#233;rience de la gestion de comptes dans une entreprise de biens de consommation avec des responsabilit&#233;s progressives.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Connaissance approfondie des ventes et capacit&#233; &#233;prouv&#233;e &#224; cr&#233;er et &#224; vendre des programmes promotionnels sp&#233;cifiques aux clients et des initiatives cl&#233;s.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Avoir la capacit&#233; &#233;prouv&#233;e de g&#233;rer les besoins et les pr&#233;occupations de multiples intervenants dans l&#8217;ensemble des diff&#233;rents syst&#232;mes d&#8217;entreprise.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Exp&#233;rience probante de l&#8217;utilisation d&#8217;applications informatiques telles que SAP, Excel, Powerpoint, etc.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Solide sens des affaires, notamment une compr&#233;hension des budgets et des co&#251;ts d&#8217;exploitation.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;&#202;tre ax&#233; sur les clients, avoir une facilit&#233; &#233;prouv&#233;e &#224; &#233;tablir des relations et avoir une solide exp&#233;rience dans l&#8217;&#233;laboration de plans de main-d&#8217;&#339;uvre bas&#233;s sur des objectifs op&#233;rationnels.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;&#202;tre apte et capable de s&#8217;&#233;panouir dans un environnement dynamique et en &#233;volution rapide.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;li&gt;&lt;span style=&quot;font-size:9.5pt&quot;&gt;&lt;span&gt;&lt;span style=&quot;font-family:Arial, sans-serif&quot;&gt;Poss&#233;der des comp&#233;tences &#233;prouv&#233;es en collaboration, et avoir la capacit&#233; de parvenir &#224; un consensus gr&#226;ce &#224; une influence personnelle.&lt;/span&gt;&lt;/span&gt;&lt;/span&gt;&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;&lt;b&gt;&#192; propos de nous : Nous sommes une entreprise fi&#232;rement canadienne et ind&#233;pendante; nous sommes Coke Canada!&#160;&lt;/b&gt;&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;La Compagnie d&#8217;embouteillage Coca-Cola Canada Limit&#233;e est la plus importante entreprise d&#8217;embouteillage au Canada. Nous sommes une entreprise ind&#233;pendante qui compte plus de 5 800 employ&#233;s et dispose d&#8217;un r&#233;seau de plus de 50 centres de ventes et de distribution, ainsi que de cinq usines de fabrication, &#224; l&#8217;&#233;chelle du pays.&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;&lt;b&gt;Important:&lt;/b&gt;&lt;/p&gt;&lt;p&gt;Toutes les offres d&#8217;emploi &#224; la Compagnie d&#8217;embouteillage Coca-Cola Canada Limit&#233;e (&#171; Coke Canada &#187;) sont conditionnelles &#224; l&#8217;obtention de r&#233;sultats satisfaisants lors d&#8217;une v&#233;rification des ant&#233;c&#233;dents, men&#233;e par un fournisseur externe. Les r&#233;sultats dits &#171; satisfaisants &#187; d&#233;pendront du poste et peuvent n&#233;cessiter toutes les v&#233;rifications suivantes ou certaines d&#8217;entre elles : v&#233;rification du casier judiciaire, v&#233;rification de l&#8217;historique d&#8217;emploi, v&#233;rification de la formation scolaire, v&#233;rification du dossier de conduite. Veuillez faire part &#224; l&#8217;&#233;quipe d&#8217;attraction de talents de toute question ou inqui&#233;tude &#224; cet &#233;gard une fois que l&#8217;on vous avisera que votre candidature est retenue.&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;Coke Canada s&#8217;engage &#224; composer un effectif inclusif et diversifi&#233;; l&#8217;entreprise compte de nombreux programmes, politiques et ressources, mis en place dans le but de soutenir son personnel. Les personnes handicap&#233;es qui ont besoin d&#8217;accommodement ou de soutien dans le cadre du processus de recrutement sont pri&#233;es de communiquer avec l&#8217;&#233;quipe des services d&#8217;attraction de talents par t&#233;l&#233;phone, au +1 844 383-2653, ou par courriel, au HR@cokecanada.com&lt;br&gt;&#160;&lt;/p&gt;&lt;p&gt;Pour plus d &#8217;information, veuillez visiter cokecanada.com/home-fr&lt;/p&gt;</description>
        </job>
        <job>
            <title>Sales Execution Lead</title>
            <date>Fri, 13 06 2025 00:00:00 GMT</date>
            <ID>100002-en_GB</ID>
            <url>https://conaservict1.valhalla.stage.jobs2web.com/canada/job/Amherst-Sales-Execution-Lead-QC-H1N-2G9/143644350/?feedId=4758750&amp;utm_source=Paradox</url>
            <company>Coca-Cola Canada Bottling Limited</company>
            <city>Amherst</city>
            <state>QC</state>
            <postalcode>H1N 2G9</postalcode>
            <country>CA</country>
            <multilocation>Amherst, QC, CA, H1N 2G9</multilocation>
            <category>Finance and Accounting</category>
            <department>L&apos;Assomption - Merchandising 3</department>
            <type></type>
            <businessunit>Coke Canada</businessunit>
            <recruiter>thao.le+458935@paradox.ai</recruiter>
            <hiringmanager>thao.le+22894@paradox.ai</hiringmanager>
            <recruiterid>1004551</recruiterid>
            <jobtype>L&apos;Assomption, QC (5C51)</jobtype>
            <brand>canada</brand>
            <customfield1>Regular Employee FT</customfield1>
            <customfield2>Salaried</customfield2>
            <customfield3>L&apos;Assomption, QC (5C51)</customfield3>
            <customfield4></customfield4>
            <customfield5>Finance and Accounting</customfield5>
            <description>&lt;p&gt;&lt;strong&gt;Coke Canada Bottling is Canada&#8217;s Local Bottler. We&#8217;re Made Local.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;Proudly independent, we are a Canadian, family-owned business. Coke Canada Bottling makes, distributes, merchandises, and sells the most-loved beverages Canadians enjoy. With over 6,000 diverse employees coast-to-coast, we operate in every province through 50+ sales and distribution centres, and five manufacturing facilities.&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;Coke Canada supplies some of Canada&#8217;s favourite beverage brands, and we want to continue to be the leading beverage partner in Canada, creating a better future and delivering optimism by bringing sustainable value to our employees, customers, consumers, and communities.&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;Advancing a high-performing, collaborative and inclusive culture is at the core of our Vision to be the World&#8217;s Greatest Bottler, Built by the Best People, and we&#8217;re looking for exceptional talent to help get us there.&#160;&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;For more information about Coke Canada Bottling and our products, visit &lt;a title=&quot;&quot; href=&quot;cokecanada.com&quot; target=&quot;_self&quot;&gt;cokecanada.com&lt;/a&gt;&lt;br&gt;&#160;&lt;/p&gt;&lt;div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;About This Opportunity&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;The Sales Execution Lead (SEL) directly leads the Coke Canada&apos;s Sales Execution team within the assigned area. This role is responsible for translating strategic priorities into operational execution in Coke Canada&apos;s customers&apos; stores.&#160; Customers will mostly be comprised of national and local grocery chains and mass merchandisers.&lt;br&gt;&#160;&lt;br&gt;Through the Sales Execution team, the SEL is responsible for ensuring our customers are always &#8220;in-stock&#8221; on shelves, displays and in coolers across the Coke Canada portfolio of beverages in order to capture maximum sales and ensure our products are executed to the company&apos;s standards.&lt;br&gt;&#160;&lt;br&gt;We strive to be our customers most valued supplier by delivering superior customer service and provide a point of difference from our competition. We deliver all of the above while achieving all of our budget targets.&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;Responsibilities&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;Staff, train, evaluate and develop a team of full time and part time Sales Execution Associates (SEA).&lt;/li&gt;&lt;li&gt;Establish partnership with customers, ensuring needs are met.&#160; Promptly respond&#160;to customer queries and issues.&lt;/li&gt;&lt;li&gt;Negotiate and optimize&#160;customer service levels based on company guidelines&lt;/li&gt;&lt;li&gt;Visit customers&apos; stores to monitor adherence to execution standards and ensure customer satisfaction.&lt;/li&gt;&lt;li&gt;Schedule team members to meet the demands of the business, flexing labour to match volume.&lt;/li&gt;&lt;li&gt;Manage team within labour and operating budget.&lt;/li&gt;&lt;li&gt;Collaborate daily with internal Sales and Customer Operations partners to ensure alignment on all initiatives.&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;/div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;Qualifications&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;Bachelor&apos;s degree, in Business or related background preferred with&lt;/li&gt;&lt;li&gt;1-3 years progressive Sales experience&#160;&lt;/li&gt;&lt;li&gt;Previous progressive responsibility with account management at a consumer goods organization&lt;/li&gt;&lt;li&gt;Complex selling knowledge with proven ability to create and sell-in customer specific&#160;promotional programs and key initiatives&lt;/li&gt;&lt;li&gt;Proven ability to manage needs and concerns of multiple stakeholders across various business systems.&lt;/li&gt;&lt;li&gt;Proficient experience with computer application such as SAP, Excel, Powerpoint etc.&#160;&lt;/li&gt;&lt;li&gt;Strong business acumen, including an understanding of budgets and operating costs&#160;&lt;/li&gt;&lt;li&gt;Customer focused with proven relationship building strengths and solid experience developing workforce plans based on business goals&#160;&lt;/li&gt;&lt;li&gt;Comfort and ability to thrive in a high-change, fasted paced environment&#160;&lt;/li&gt;&lt;li&gt;Proven collaboration skills with the ability to gain consensus through personal influence&#160;&lt;/li&gt;&lt;li&gt;Demonstrated ability to invite diverse perspectives, promote an inclusive work environment and support workforce diversity&#160;&lt;/li&gt;&lt;li&gt;Accomplished team-builder, skilled at inspiring, motivating and developing people&#160;&lt;/li&gt;&lt;li&gt;Ability to operate a manual/powered pallet jack or lift product.&lt;/li&gt;&lt;li&gt;Valid driver&apos;s license and driving record within MVR policy guidelines&lt;/li&gt;&lt;li&gt;Ability to lift 50 lbs- physical demands while working with the team in field&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Why work with us?&#160;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Join a local, family-owned business that&#8217;s part of a globally recognised brand, where you can develop your capabilities, competencies, and career.&lt;/li&gt;&lt;li&gt;Coke Canada has a culture of learning, and we offer several channels to support your development, including on-the-job training and a library of free courses for just-in-time learning.&lt;/li&gt;&lt;li&gt;We have generous referral rewards and recognition programs you can participate in.&lt;/li&gt;&lt;li&gt;We have close, local connections with the communities in which we operate across Canada. We&#8217;re determined to make a positive difference in our communities, this includes opportunities for employee volunteerism.&lt;/li&gt;&lt;li&gt;We&#8217;re building our business responsibly and our mission is to work Toward a Better Future Together. We have a plan that outlines how we are reducing, reusing, recycling, decreasing our carbon footprint, and using water responsibly. For more information, visit cokecanada.com/sustainability/&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;Coke Canada has been recognized as one of Canada&#8217;s Best Employers for Diversity, and we&#8217;re committed to fostering a diverse, equitable and inclusive workplace. Together we are creating a workplace culture that values diversity, enables inclusivity and ensures everyone feels like they belong. We are aiming to ensure our diverse workforce is reflective of the communities in which we operate. For individuals requiring accommodations or support throughout the recruitment process please call 1-844-383-2653 or email interviewaccommodations@cokecanada.com.&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Important &#8211; please note&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;All offers of employment at Coke Canada Bottling are conditional upon a successful background clearance obtained through our contracted third-party vendor. The standard clearance requirements depend on the position and may include some, or all, of the following: criminal clearance, employment verification, education verification and driver&apos;s abstract review. Please advise the Talent Acquisition team if you have any questions or concerns once you are contacted for further consideration.&lt;br&gt;&#160;&lt;/p&gt;</description>
        </job>
        <job>
            <title>Acceptant Volmacht Medior - Verzuim</title>
            <date>Fri, 13 06 2025 00:00:00 GMT</date>
            <ID>100003-nl_NL</ID>
            <url>https://conaservict1.valhalla.stage.jobs2web.com/canada/job/Amherst-Superviseur%2C-execution-des-ventes-QC-H1N-2G9/143644250/?feedId=4758750&amp;utm_source=Paradox</url>
            <company>Dit is een testbaan in het Nederlands</company>
            <city>Amherst</city>
            <state>QC</state>
            <postalcode>H1N 2G9</postalcode>
            <country>CA</country>
            <multilocation>Amherst, QC, CA, H1N 2G9</multilocation>
            <category>Finance and Accounting</category>
            <department>L&apos;Assomption - Merchandising 3</department>
            <type></type>
            <businessunit>Coke Canada</businessunit>
            <recruiter>thao.le+227583@paradox.ai</recruiter>
            <hiringmanager>thao.le+22894@paradox.ai</hiringmanager>
            <recruiterid>1004551</recruiterid>
            <jobtype>Dit is een testbaan in het Nederlands</jobtype>
            <brand>canada</brand>
            <customfield1>Regular Employee FT</customfield1>
            <customfield2>Salaried</customfield2>
            <customfield3>Dit is een testbaan in het Nederlands</customfield3>
            <customfield4></customfield4>
            <customfield5>Finance and Accounting</customfield5>
            <description>Dit is een testbaan in het Nederlands</description>
        </job>
        <job>
            <title>Underwriter (Mandate) Mid-level – Absence</title>
            <date>Fri, 13 06 2025 00:00:00 GMT</date>
            <ID>100003-en_GB</ID>
            <url>https://conaservict1.valhalla.stage.jobs2web.com/canada/job/Amherst-Sales-Execution-Lead-QC-H1N-2G9/143644350/?feedId=4758750&amp;utm_source=Paradox</url>
            <company>Coca-Cola Canada Bottling Limited</company>
            <city>Amherst</city>
            <state>QC</state>
            <postalcode>H1N 2G9</postalcode>
            <country>CA</country>
            <multilocation>Amherst, QC, CA, H1N 2G9</multilocation>
            <category>Finance and Accounting</category>
            <department>L&apos;Assomption - Merchandising 3</department>
            <type></type>
            <businessunit>Coke Canada</businessunit>
            <recruiter>thao.le+227583@paradox.ai</recruiter>
            <hiringmanager>thao.le+22894@paradox.ai</hiringmanager>
            <recruiterid>1004551</recruiterid>
            <jobtype>L&apos;Assomption, QC (5C51)</jobtype>
            <brand>canada</brand>
            <customfield1>Regular Employee FT</customfield1>
            <customfield2>Salaried</customfield2>
            <customfield3>L&apos;Assomption, QC (5C51)</customfield3>
            <customfield4></customfield4>
            <customfield5>Finance and Accounting</customfield5>
            <description>&lt;p&gt;&lt;strong&gt;Coke Canada Bottling is Canada&#8217;s Local Bottler. We&#8217;re Made Local.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;Proudly independent, we are a Canadian, family-owned business. Coke Canada Bottling makes, distributes, merchandises, and sells the most-loved beverages Canadians enjoy. With over 6,000 diverse employees coast-to-coast, we operate in every province through 50+ sales and distribution centres, and five manufacturing facilities.&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;Coke Canada supplies some of Canada&#8217;s favourite beverage brands, and we want to continue to be the leading beverage partner in Canada, creating a better future and delivering optimism by bringing sustainable value to our employees, customers, consumers, and communities.&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;Advancing a high-performing, collaborative and inclusive culture is at the core of our Vision to be the World&#8217;s Greatest Bottler, Built by the Best People, and we&#8217;re looking for exceptional talent to help get us there.&#160;&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;For more information about Coke Canada Bottling and our products, visit &lt;a title=&quot;&quot; href=&quot;cokecanada.com&quot; target=&quot;_self&quot;&gt;cokecanada.com&lt;/a&gt;&lt;br&gt;&#160;&lt;/p&gt;&lt;div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;About This Opportunity&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;p&gt;The Sales Execution Lead (SEL) directly leads the Coke Canada&apos;s Sales Execution team within the assigned area. This role is responsible for translating strategic priorities into operational execution in Coke Canada&apos;s customers&apos; stores.&#160; Customers will mostly be comprised of national and local grocery chains and mass merchandisers.&lt;br&gt;&#160;&lt;br&gt;Through the Sales Execution team, the SEL is responsible for ensuring our customers are always &#8220;in-stock&#8221; on shelves, displays and in coolers across the Coke Canada portfolio of beverages in order to capture maximum sales and ensure our products are executed to the company&apos;s standards.&lt;br&gt;&#160;&lt;br&gt;We strive to be our customers most valued supplier by delivering superior customer service and provide a point of difference from our competition. We deliver all of the above while achieving all of our budget targets.&lt;/p&gt;&lt;/div&gt;&lt;/div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;Responsibilities&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;Staff, train, evaluate and develop a team of full time and part time Sales Execution Associates (SEA).&lt;/li&gt;&lt;li&gt;Establish partnership with customers, ensuring needs are met.&#160; Promptly respond&#160;to customer queries and issues.&lt;/li&gt;&lt;li&gt;Negotiate and optimize&#160;customer service levels based on company guidelines&lt;/li&gt;&lt;li&gt;Visit customers&apos; stores to monitor adherence to execution standards and ensure customer satisfaction.&lt;/li&gt;&lt;li&gt;Schedule team members to meet the demands of the business, flexing labour to match volume.&lt;/li&gt;&lt;li&gt;Manage team within labour and operating budget.&lt;/li&gt;&lt;li&gt;Collaborate daily with internal Sales and Customer Operations partners to ensure alignment on all initiatives.&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;/div&gt;&lt;div style=&quot;padding:10.0px 0.0px;border:1.0px solid transparent&quot;&gt;&lt;div style=&quot;font-size:16.0px;word-wrap:break-word&quot;&gt;&lt;H2 style=&quot;font-size:1.0em;margin:0.0px&quot;&gt;&lt;b&gt;Qualifications&lt;/b&gt;&lt;/H2&gt;&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;Bachelor&apos;s degree, in Business or related background preferred with&lt;/li&gt;&lt;li&gt;1-3 years progressive Sales experience&#160;&lt;/li&gt;&lt;li&gt;Previous progressive responsibility with account management at a consumer goods organization&lt;/li&gt;&lt;li&gt;Complex selling knowledge with proven ability to create and sell-in customer specific&#160;promotional programs and key initiatives&lt;/li&gt;&lt;li&gt;Proven ability to manage needs and concerns of multiple stakeholders across various business systems.&lt;/li&gt;&lt;li&gt;Proficient experience with computer application such as SAP, Excel, Powerpoint etc.&#160;&lt;/li&gt;&lt;li&gt;Strong business acumen, including an understanding of budgets and operating costs&#160;&lt;/li&gt;&lt;li&gt;Customer focused with proven relationship building strengths and solid experience developing workforce plans based on business goals&#160;&lt;/li&gt;&lt;li&gt;Comfort and ability to thrive in a high-change, fasted paced environment&#160;&lt;/li&gt;&lt;li&gt;Proven collaboration skills with the ability to gain consensus through personal influence&#160;&lt;/li&gt;&lt;li&gt;Demonstrated ability to invite diverse perspectives, promote an inclusive work environment and support workforce diversity&#160;&lt;/li&gt;&lt;li&gt;Accomplished team-builder, skilled at inspiring, motivating and developing people&#160;&lt;/li&gt;&lt;li&gt;Ability to operate a manual/powered pallet jack or lift product.&lt;/li&gt;&lt;li&gt;Valid driver&apos;s license and driving record within MVR policy guidelines&lt;/li&gt;&lt;li&gt;Ability to lift 50 lbs- physical demands while working with the team in field&lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Why work with us?&#160;&lt;/strong&gt;&lt;/p&gt;&lt;ul&gt;&lt;li&gt;Join a local, family-owned business that&#8217;s part of a globally recognised brand, where you can develop your capabilities, competencies, and career.&lt;/li&gt;&lt;li&gt;Coke Canada has a culture of learning, and we offer several channels to support your development, including on-the-job training and a library of free courses for just-in-time learning.&lt;/li&gt;&lt;li&gt;We have generous referral rewards and recognition programs you can participate in.&lt;/li&gt;&lt;li&gt;We have close, local connections with the communities in which we operate across Canada. We&#8217;re determined to make a positive difference in our communities, this includes opportunities for employee volunteerism.&lt;/li&gt;&lt;li&gt;We&#8217;re building our business responsibly and our mission is to work Toward a Better Future Together. We have a plan that outlines how we are reducing, reusing, recycling, decreasing our carbon footprint, and using water responsibly. For more information, visit cokecanada.com/sustainability/&lt;/li&gt;&lt;/ul&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;Coke Canada has been recognized as one of Canada&#8217;s Best Employers for Diversity, and we&#8217;re committed to fostering a diverse, equitable and inclusive workplace. Together we are creating a workplace culture that values diversity, enables inclusivity and ensures everyone feels like they belong. We are aiming to ensure our diverse workforce is reflective of the communities in which we operate. For individuals requiring accommodations or support throughout the recruitment process please call 1-844-383-2653 or email interviewaccommodations@cokecanada.com.&lt;/p&gt;&lt;p&gt;&#160;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Important &#8211; please note&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;All offers of employment at Coke Canada Bottling are conditional upon a successful background clearance obtained through our contracted third-party vendor. The standard clearance requirements depend on the position and may include some, or all, of the following: criminal clearance, employment verification, education verification and driver&apos;s abstract review. Please advise the Talent Acquisition team if you have any questions or concerns once you are contacted for further consideration.&lt;br&gt;&#160;&lt;/p&gt;</description>
        </job></jobs>
</source>